; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v5)
		(pred_2 ?v4)
		(pred_4 ?v3)
		(pred_3 ?v3)
		(pred_6 ?v4 ?v3)
		(pred_5)
		(pred_1 ?v4))

   (:action op_2
       :parameters  (?v8 ?v2)
       :precondition (and (not-eq ?v8 ?v2) 
                          (pred_4 ?v8) (pred_4 ?v2) (pred_3 ?v8))
       :effect (and  (pred_3 ?v2)
		     (not (pred_3 ?v8))))


   (:action op_3
       :parameters (?v7 ?v6)
       :precondition  (and  (pred_2 ?v7) (pred_4 ?v6)
			    (pred_6 ?v7 ?v6) (pred_3 ?v6) (pred_5))
       :effect (and (pred_1 ?v7)
		    (not (pred_6 ?v7 ?v6)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v7  ?v6)
       :precondition  (and  (pred_2 ?v7) (pred_4 ?v6)
			    (pred_1 ?v7) (pred_3 ?v6))
       :effect (and (pred_6 ?v7 ?v6)
		    (pred_5)
		    (not (pred_1 ?v7)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_01 obj_05 obj_04 obj_02 
          obj_07 obj_06 obj_03 
)
(:init
(pred_4 obj_01)
(pred_4 obj_05)
(pred_4 obj_04)
(pred_4 obj_02)
(pred_2 obj_07)
(pred_2 obj_06)
(pred_2 obj_03)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(pred_5)
(pred_6 obj_07 obj_05)
(pred_6 obj_06 obj_01)
(pred_6 obj_03 obj_04)
(pred_3 obj_05)
)
(:goal
(and
(pred_6 obj_07 obj_04)
(pred_6 obj_06 obj_04)
(pred_6 obj_03 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_07 obj_04) (pred_3 obj_01))
    (sometime-before  (pred_6 obj_06 obj_04) (pred_3 obj_02))
  )
)
)

; plan
1. (op_3 obj_07 obj_05)
   deleted: (pred_6 obj_07 obj_05) (pred_5)
   added: (pred_1 obj_07)
   goals met: 1 of 3
2. (op_2 obj_05 obj_02)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_02)
   goals met: 1 of 3
3. (op_1 obj_07 obj_02)
   deleted: (pred_1 obj_07)
   added: (pred_6 obj_07 obj_02) (pred_5)
   goals met: 1 of 3
4. (op_2 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_01)
   goals met: 1 of 3
5. (op_3 obj_06 obj_01)
   deleted: (pred_6 obj_06 obj_01) (pred_5)
   added: (pred_1 obj_06)
   goals met: 1 of 3
6. (op_2 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_04)
   goals met: 1 of 3
7. (op_1 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_6 obj_06 obj_04) (pred_5)
   goals met: 2 of 3
8. (op_2 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 2 of 3
9. (op_3 obj_07 obj_02)
   deleted: (pred_6 obj_07 obj_02) (pred_5)
   added: (pred_1 obj_07)
   goals met: 2 of 3
10. (op_2 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_04)
   goals met: 2 of 3
11. (op_1 obj_07 obj_04)
   deleted: (pred_1 obj_07)
   added: (pred_6 obj_07 obj_04) (pred_5)
   goals met: 3 of 3
